tutorials/biofilmPimpleFoam/3d-packing/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              1.0e-6;

d1    1.6e-09;

mmax  40;

c0    2e-03;

mum   1.5e-05;

Yxs   0.045;

ms    3e-05;

Ks    1.5e-05;

eps   1e-04;

a     4;

b     4;

// ************************************************************************* //
